# Analysis of Successful Movies (Notebook 4)
* Benjamin Grossmann

This notebook goes through the creating of a MySQL database using the data aquired in Notebook 1 and Notebook 2.

# Initial Imports and Loads

In [1]:
import numpy as np
import pandas as pd

In [2]:
df_title_basics = pd.read_csv('Data/title_basics.csv.gz')
df_title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
df_title_tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
df_akas = pd.read_csv('Data/title_akas.csv.gz')

In [3]:
display(df_title_basics.head(2))
display(df_title_ratings.head(2))
display(df_title_tmdb.head(2))
display(df_akas.head(2))

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,70,Drama

      tconst  averageRating  numVotes
0  tt0035423            6.4     83931
1  tt0062336            6.4       161

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification,r_to_b_ratio
0,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1880.0,PG,85.699687
1,tt0119273,0.0,/fClJrAmJQ90zg9gWnfHVYSMiDTv.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.1,151.0,R,0.000000

,tconst,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0035423,35,Kate and Leopold,US,NaN,NaN,alternative spelling,0
1,tt0035423,37,Kate & Leopold,US,NaN,imdbDisplay,NaN,0

# Tidy Things Up

## Dropping Unneeded Columns

Some columns have information that will not be needed, so they will be dropped.

There are also columns that information we want, but are duplicated in multiple dataframes (ex. the movie runtime is in both df_title_basics and df_title_tmdb_2000). They will be dropped from all but one dataframe.

In [4]:
df_title_basics.drop(['originalTitle','isAdult','titleType'],axis=1,inplace=True)
df_title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,Grizzly II: Revenge,2020,74,"Horror,Music,Thriller"

In [5]:
df_title_tmdb = df_title_tmdb[['imdb_id', 'revenue', 'budget', 'certification']]
display(df_title_tmdb.head(3))

     imdb_id     revenue      budget certification
0  tt0118694  12854953.0    150000.0            PG
1  tt0119273         0.0  15000000.0             R
2  tt0120467     14904.0    120000.0             R

## Matching Column Names

It will be easier if the movie id has the same name in all the tables it appears. Right now it is 'tconst' and 'imdb_id'. I will change them all to match 'tconst'.

In [6]:
# match the id column name to that of the other tables
df_title_tmdb = df_title_tmdb.rename(columns={'imdb_id':'tconst'})
display(df_title_tmdb.head(3))

      tconst     revenue      budget certification
0  tt0118694  12854953.0    150000.0            PG
1  tt0119273         0.0  15000000.0             R
2  tt0120467     14904.0    120000.0             R

## Numerical Data Types

In [7]:
# Change the financial columns to integers
df_title_tmdb['revenue'] = df_title_tmdb['revenue'].apply(int)
df_title_tmdb['budget'] = df_title_tmdb['budget'].apply(int)
display(df_title_tmdb.head(3))

      tconst   revenue    budget certification
0  tt0118694  12854953    150000            PG
1  tt0119273         0  15000000             R
2  tt0120467     14904    120000             R

## Dropping Movies Without Certification

Since the dataframe from TMDB has only movies with certifications G, PG, PF-13, and R, I can use it to drop any movies in the other dataframes that don't have a known certification.

In [8]:
print(f'df_title_basics dataframe shape: {df_title_basics.shape}')

# Filter out entries from the basics dataframe that don't have a rating
print(f'Eliminating entries without certification in df_title_tmdb.')
basics_matches_tmdb =  df_title_basics['tconst'].isin(df_title_tmdb['tconst'])
df_title_basics = df_title_basics.loc[ basics_matches_tmdb , :]

print(f'df_title_basics dataframe shape: {df_title_basics.shape}')
df_title_basics.head()

df_title_basics dataframe shape: (79345, 5)
Eliminating entries without certification in df_title_tmdb.
df_title_basics dataframe shape: (6141, 5)

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
2,tt0069049,The Other Side of the Wind,2018,122,Drama
18,tt0118589,Glitter,2001,104,"Drama,Music,Romance"
19,tt0118652,The Attic Expeditions,2001,100,"Comedy,Horror,Mystery"
20,tt0118694,In the Mood for Love,2000,98,"Drama,Romance"

In [9]:
print(f'df_title_ratings dataframe shape: {df_title_ratings.shape}')

# Filter out entries from the basics dataframe that don't have a rating
print(f'Eliminating entries without certification in df_title_tmdb.')
ratings_matches_tmdb =  df_title_ratings['tconst'].isin(df_title_tmdb['tconst'])
df_title_ratings = df_title_ratings.loc[ ratings_matches_tmdb , :]

print(f'df_title_ratings dataframe shape: {df_title_ratings.shape}')
df_title_ratings.head()

df_title_ratings dataframe shape: (65789, 3)
Eliminating entries without certification in df_title_tmdb.
df_title_ratings dataframe shape: (6124, 3)

       tconst  averageRating  numVotes
0   tt0035423            6.4     83931
2   tt0069049            6.7      7250
18  tt0118589            2.3     23475
19  tt0118652            4.9      1819
20  tt0118694            8.0    145527

In [10]:
print(f'df_akas dataframe shape: {df_akas.shape}')

# Filter out entries from the basics dataframe that don't have a rating
print(f'Eliminating entries without certification in df_title_tmdb.')
akas_matches_tmdb =  df_akas['tconst'].isin(df_title_tmdb['tconst'])
df_akas = df_akas.loc[ akas_matches_tmdb , :]

print(f'df_akas dataframe shape: {df_akas.shape}')
df_akas.head()

df_akas dataframe shape: (88512, 8)
Eliminating entries without certification in df_title_tmdb.
df_akas dataframe shape: (9330, 8)

,tconst,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0035423,35,Kate and Leopold,US,NaN,NaN,alternative spelling,0
1,tt0035423,37,Kate & Leopold,US,NaN,imdbDisplay,NaN,0
3,tt0069049,3,The Other Side of the Wind,US,NaN,imdbDisplay,NaN,0
25,tt0118589,17,Glitter,US,NaN,imdbDisplay,NaN,0
26,tt0118589,21,All That Glitters,US,NaN,working,NaN,0

# Normalizing Tables

## Movie Genre

First, movies that have multiple genres need to have the genres separated.

In [11]:
# create column with the genres as a list instead of a single string
df_title_basics['genres_split'] = df_title_basics['genres'].str.split(',')
df_title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
2,tt0069049,The Other Side of the Wind,2018,122,Drama,[Drama]
18,tt0118589,Glitter,2001,104,"Drama,Music,Romance","[Drama, Music, Romance]"
19,tt0118652,The Attic Expeditions,2001,100,"Comedy,Horror,Mystery","[Comedy, Horror, Mystery]"
20,tt0118694,In the Mood for Love,2000,98,"Drama,Romance","[Drama, Romance]"

In [12]:
# give each genre in a list its own row
df_title_basics = df_title_basics.explode('genres_split')
df_title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance",Romance
2,tt0069049,The Other Side of the Wind,2018,122,Drama,Drama
18,tt0118589,Glitter,2001,104,"Drama,Music,Romance",Drama

### Create mapping dictionary
From the column of separated genres, create a new dataframe with unique genre values.

In [13]:
genre_list = sorted(df_title_basics['genres_split'].unique())
genre_ids = range(len(genre_list))
genre_map = dict(zip(genre_list, genre_ids))
genre_map

{'Action': 0,
 'Adventure': 1,
 'Animation': 2,
 'Biography': 3,
 'Comedy': 4,
 'Crime': 5,
 'Drama': 6,
 'Family': 7,
 'Fantasy': 8,
 'History': 9,
 'Horror': 10,
 'Music': 11,
 'Musical': 12,
 'Mystery': 13,
 'Romance': 14,
 'Sci-Fi': 15,
 'Sport': 16,
 'Thriller': 17,
 'War': 18,
 'Western': 19}

### Create genres table

In [14]:
df_genres = pd.DataFrame({'genre_name':genre_map.keys(),'genre_id':genre_map.values()})
df_genres.head()

  genre_name  genre_id
0     Action         0
1  Adventure         1
2  Animation         2
3  Biography         3
4     Comedy         4

### Create linking table

Next, create a linking table that connects each movie (using its identifying code 'tconst') with its genres (using the 'genre_id').

In [15]:
# create the table from information in df_title_basics
df_title_genres = df_title_basics[['tconst','genres_split']].copy()
df_title_genres.head()

       tconst genres_split
0   tt0035423       Comedy
0   tt0035423      Fantasy
0   tt0035423      Romance
2   tt0069049        Drama
18  tt0118589        Drama

In [16]:
# replace the genre names with their id values and relabel the column
df_title_genres = df_title_genres.replace(genre_map).rename(columns={'genres_split':'genre_id'})
df_title_genres.head()

       tconst  genre_id
0   tt0035423         4
0   tt0035423         8
0   tt0035423        14
2   tt0069049         6
18  tt0118589         6

### Drop original columns

Finally, drop the unnecessary columns from the oringinal table used to create the new tables. That information is no longer necessary in the original table.

In [17]:
df_title_basics = df_title_basics.drop(['genres','genres_split'], axis=1)
df_title_basics.head()

       tconst                primaryTitle  startYear  runtimeMinutes
0   tt0035423              Kate & Leopold       2001             118
0   tt0035423              Kate & Leopold       2001             118
0   tt0035423              Kate & Leopold       2001             118
2   tt0069049  The Other Side of the Wind       2018             122
18  tt0118589                     Glitter       2001             104

Now that the 'genre_split' column is gone, the duplicated rows can be dropped (the ones created from the .explode() method).

In [18]:
df_title_basics.drop_duplicates(inplace=True)
df_title_basics.head()

       tconst                primaryTitle  startYear  runtimeMinutes
0   tt0035423              Kate & Leopold       2001             118
2   tt0069049  The Other Side of the Wind       2018             122
18  tt0118589                     Glitter       2001             104
19  tt0118652       The Attic Expeditions       2001             100
20  tt0118694        In the Mood for Love       2000              98

## Movie Types

### Create mapping dictionary

In [19]:
type_list = df_akas['types'].unique().tolist()
# there are some nan values in the type column
# they don't like being sorted in a list
# so I will remove them then sort
type_list.remove(np.nan)
type_list = sorted(type_list)
# then I will put add them back in the list
type_list.insert(0,np.nan)

type_ids = range(len(type_list))
type_map = dict(zip(type_list, type_ids))
type_map

{nan: 0,
 'alternative': 1,
 'dvd': 2,
 'festival': 3,
 'imdbDisplay': 4,
 'original': 5,
 'tv': 6,
 'video': 7,
 'working': 8}

### Create types table

In [20]:
df_types = pd.DataFrame({'type_name':type_map.keys(),'type_id':type_map.values()})
df_types.head()

     type_name  type_id
0          NaN        0
1  alternative        1
2          dvd        2
3     festival        3
4  imdbDisplay        4

### Create linking table

Create a linking table linking the movies to their type.

In [21]:
# create the linking table from information in df_akas
df_title_types = df_akas[['tconst','types']].copy()
df_title_types.head()

       tconst        types
0   tt0035423          NaN
1   tt0035423  imdbDisplay
3   tt0069049  imdbDisplay
25  tt0118589  imdbDisplay
26  tt0118589      working

In [22]:
# replace the genre names with their id values and relabel the column
df_title_types = df_title_types.replace(type_map).rename(columns={'types':'type_id'})
df_title_types.head()

       tconst  type_id
0   tt0035423        0
1   tt0035423        4
3   tt0069049        4
25  tt0118589        4
26  tt0118589        8

### Drop original columns

In [23]:
df_akas = df_akas.drop(['types'], axis=1)
df_akas.head()

,tconst,ordering,title,region,language,attributes,isOriginalTitle
0,tt0035423,35,Kate and Leopold,US,NaN,alternative spelling,0
1,tt0035423,37,Kate & Leopold,US,NaN,NaN,0
3,tt0069049,3,The Other Side of the Wind,US,NaN,NaN,0
25,tt0118589,17,Glitter,US,NaN,NaN,0
26,tt0118589,21,All That Glitters,US,NaN,NaN,0

## Movie Language

### Create mapping dictionary

In [24]:
lang_list = df_akas['language'].unique().tolist()
# there are some nan values in the language column
# they don't like being sorted in a list
# so I will remove them then sort
lang_list.remove(np.nan)
lang_list = sorted(lang_list)
# then I will put add them back in the list
lang_list.insert(0,np.nan)

lang_ids = range(len(lang_list))
lang_map = dict(zip(lang_list, lang_ids))
lang_map

{nan: 0, 'en': 1, 'es': 2, 'yi': 3}

### Create languages table

In [25]:
df_languages = pd.DataFrame({'language_name':lang_map.keys(),'language_id':lang_map.values()})
df_languages.head()

  language_name  language_id
0           NaN            0
1            en            1
2            es            2
3            yi            3

### Create linking table

In [26]:
# create the linking table from information in df_akas
df_title_languages = df_akas[['tconst','language']].copy()
df_title_languages.head()

       tconst language
0   tt0035423      NaN
1   tt0035423      NaN
3   tt0069049      NaN
25  tt0118589      NaN
26  tt0118589      NaN

In [27]:
# replace the genre names with their id values and relabel the column
df_title_languages = df_title_languages.replace(lang_map).rename(columns={'language':'language_id'})
df_title_languages.head()

       tconst  language_id
0   tt0035423            0
1   tt0035423            0
3   tt0069049            0
25  tt0118589            0
26  tt0118589            0

### Drop original columns

In [28]:
df_akas = df_akas.drop(['language'], axis=1)
df_akas.head()

,tconst,ordering,title,region,attributes,isOriginalTitle
0,tt0035423,35,Kate and Leopold,US,alternative spelling,0
1,tt0035423,37,Kate & Leopold,US,NaN,0
3,tt0069049,3,The Other Side of the Wind,US,NaN,0
25,tt0118589,17,Glitter,US,NaN,0
26,tt0118589,21,All That Glitters,US,NaN,0

## Movie Title Attributes

### Create mapping dictionary

In [29]:
# there is an alternate spelling that needs to be standardized
df_akas['attributes'].replace({'première title':'premiere title'}, inplace=True)

attr_list = df_akas['attributes'].unique().tolist()
# # there are some nan values in the language column
# # they don't like being sorted in a list
# # so I will remove them then sort
attr_list.remove(np.nan)
attr_list = sorted(attr_list)
# # then I will put add them back in the list
attr_list.insert(0,np.nan)
# display(attr_list)

attr_ids = range(len(attr_list))
attr_map = dict(zip(attr_list, attr_ids))
attr_map

{nan: 0,
 '3-D version': 1,
 'DVD box title': 2,
 'IMAX version': 3,
 'IMAX version\x02promotional title': 4,
 'alternative spelling': 5,
 'alternative transliteration': 6,
 'anthology series': 7,
 'bootleg title': 8,
 'bowdlerized title': 9,
 'cable TV title': 10,
 'censored version': 11,
 'closing credits title': 12,
 'complete title': 13,
 'copyright title': 14,
 'correct transliteration': 15,
 'cut version': 16,
 "director's cut": 17,
 'dubbed version': 18,
 'fake working title': 19,
 'informal English title': 20,
 'informal alternative title': 21,
 'informal literal English title': 22,
 'informal short title': 23,
 'informal title': 24,
 'literal English title': 25,
 'literal title': 26,
 'long title': 27,
 'longer version': 28,
 'new title': 29,
 'original script title': 30,
 'orthographically correct title': 31,
 'poster title': 32,
 'pre-release title': 33,
 'premiere title': 34,
 'promotional abbreviation': 35,
 'promotional title': 36,
 'recut version': 37,
 'reissue title': 38,
 'restored version': 39,
 'segment title': 40,
 'short title': 41,
 'subtitle': 42,
 'trailer title': 43,
 'uncensored intended title': 44,
 'video box title': 45}

### Create attributes table

In [30]:
df_attributes = pd.DataFrame({'attribute_name':attr_map.keys(),'attribute_id':attr_map.values()})
df_attributes.head()

                   attribute_name  attribute_id
0                             NaN             0
1                     3-D version             1
2                   DVD box title             2
3                    IMAX version             3
4  IMAX versionpromotional title             4

### Create linking table

In [31]:
# create the linking table from information in df_akas
df_title_attributes = df_akas[['tconst','attributes']].copy()
df_title_attributes.head()

       tconst            attributes
0   tt0035423  alternative spelling
1   tt0035423                   NaN
3   tt0069049                   NaN
25  tt0118589                   NaN
26  tt0118589                   NaN

In [32]:
# replace the attribute names with their id values and relabel the column
df_title_attributes = df_title_attributes.replace(attr_map).rename(columns={'attributes':'attribute_id'})
df_title_attributes.head()

       tconst  attribute_id
0   tt0035423             5
1   tt0035423             0
3   tt0069049             0
25  tt0118589             0
26  tt0118589             0

### Drop original columns

In [33]:
df_akas = df_akas.drop(['attributes'], axis=1)
df_akas.head()

       tconst  ordering                       title region  isOriginalTitle
0   tt0035423        35            Kate and Leopold     US                0
1   tt0035423        37              Kate & Leopold     US                0
3   tt0069049         3  The Other Side of the Wind     US                0
25  tt0118589        17                     Glitter     US                0
26  tt0118589        21           All That Glitters     US                0

## Movie Alias

The 'tconst' column of df_akas has values that may occur multiple times. The title column has unique values, but the values (variant names of movies) seem like a terrible choice to use as a primary key. It can be possible to use the combination of 'tconst' and 'ordering', as 'ordering' is unique for variant titles of a given movie. However, I'm going to choose to create a single unique identifier for each row.

### Create unique Identifiers

In [34]:
# Each row will gain a unique alias_id from the row index of the column
df_akas['akas_id'] = df_akas.index
df_akas.head()

,tconst,ordering,title,region,isOriginalTitle,akas_id
0,tt0035423,35,Kate and Leopold,US,0,0
1,tt0035423,37,Kate & Leopold,US,0,1
3,tt0069049,3,The Other Side of the Wind,US,0,3
25,tt0118589,17,Glitter,US,0,25
26,tt0118589,21,All That Glitters,US,0,26

In [35]:
df_title_akas = df_akas[['tconst','akas_id']].copy()
df_title_akas.head()

       tconst  akas_id
0   tt0035423        0
1   tt0035423        1
3   tt0069049        3
25  tt0118589       25
26  tt0118589       26

### Drop unnecessary columns

The ordering column is now useless. And with the existance of linking table, the 'tconst' column isn't needed in the akas table.

In [36]:
df_akas = df_akas.drop(['tconst', 'ordering'], axis=1)
df_akas.head()

                         title region  isOriginalTitle  akas_id
0             Kate and Leopold     US                0        0
1               Kate & Leopold     US                0        1
3   The Other Side of the Wind     US                0        3
25                     Glitter     US                0       25
26           All That Glitters     US                0       26

# Review Tables

In [37]:
print("Primary Title and Numbers Tables")
display(df_title_basics.head(3))
display(df_title_ratings.head(3))
display(df_title_tmdb.head(3))

Primary Title and Numbers Tables

       tconst                primaryTitle  startYear  runtimeMinutes
0   tt0035423              Kate & Leopold       2001             118
2   tt0069049  The Other Side of the Wind       2018             122
18  tt0118589                     Glitter       2001             104

       tconst  averageRating  numVotes
0   tt0035423            6.4     83931
2   tt0069049            6.7      7250
18  tt0118589            2.3     23475

      tconst   revenue    budget certification
0  tt0118694  12854953    150000            PG
1  tt0119273         0  15000000             R
2  tt0120467     14904    120000             R

In [38]:
print("Property Value Tables")
display(df_akas.head(3))
display(df_genres.head(3))
display(df_types.head(3))
display(df_languages.head(3))
display(df_attributes.head(3))

Property Value Tables

                        title region  isOriginalTitle  akas_id
0            Kate and Leopold     US                0        0
1              Kate & Leopold     US                0        1
3  The Other Side of the Wind     US                0        3

  genre_name  genre_id
0     Action         0
1  Adventure         1
2  Animation         2

     type_name  type_id
0          NaN        0
1  alternative        1
2          dvd        2

  language_name  language_id
0           NaN            0
1            en            1
2            es            2

  attribute_name  attribute_id
0            NaN             0
1    3-D version             1
2  DVD box title             2

In [39]:
print("Linking Tables")
display(df_title_akas.head(3))
display(df_title_genres.head(3))
display(df_title_types.head(3))
display(df_title_languages.head(3))
display(df_title_attributes.head(3))

Linking Tables

      tconst  akas_id
0  tt0035423        0
1  tt0035423        1
3  tt0069049        3

      tconst  genre_id
0  tt0035423         4
0  tt0035423         8
0  tt0035423        14

      tconst  type_id
0  tt0035423        0
1  tt0035423        4
3  tt0069049        4

      tconst  language_id
0  tt0035423            0
1  tt0035423            0
3  tt0069049            0

      tconst  attribute_id
0  tt0035423             5
1  tt0035423             0
3  tt0069049             0

# Creating MySQL Tables

Get the MySQL engine running.

In [40]:
import json
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

with open('/Users/Benjamin/.secret/mysql.json') as f:
    login = json.load(f)

username = login['username']
password = login['password']
database = 'movies'

connection = f"mysql+pymysql://{username}:{password}@localhost/{database}"
engine = create_engine(connection)

Check to see if the the database exists, otherwise create it.

In [41]:
## Check if database exists, if not, create it
if database_exists(connection) == False:
    create_database(connection)
    print(f'The database "{database}" has been created.')
else:
    print(f'The database "{database}" already exists.')

The database "movies" already exists.

## Creating Schema

We need to know the data types in python and define their new types for MySQL.

In [42]:
table_names = ['title_basics',
               'title_ratings',
               'title_tmdb',
               'akas',
               'genres',
               'types',
               'languages',
               'attributes',
               'title_akas',
               'title_genres',
               'title_types',
               'title_languages',
               'title_attributes']

list_of_dfs = [df_title_basics,
               df_title_ratings,
               df_title_tmdb,
               df_akas,
               df_genres,
               df_types,
               df_languages,
               df_attributes,
               df_title_akas,
               df_title_genres,
               df_title_types,
               df_title_languages,
               df_title_attributes]

for df in list_of_dfs:
    df.drop_duplicates(inplace=True)

for name, df in zip(table_names,list_of_dfs):
    print(f"---  {name}  ---")
    display(dict(df.dtypes))

---  title_basics  ---

{'tconst': dtype('O'),
 'primaryTitle': dtype('O'),
 'startYear': dtype('int64'),
 'runtimeMinutes': dtype('int64')}

---  title_ratings  ---

{'tconst': dtype('O'),
 'averageRating': dtype('float64'),
 'numVotes': dtype('int64')}

---  title_tmdb  ---

{'tconst': dtype('O'),
 'revenue': dtype('int64'),
 'budget': dtype('int64'),
 'certification': dtype('O')}

---  akas  ---

{'title': dtype('O'),
 'region': dtype('O'),
 'isOriginalTitle': dtype('int64'),
 'akas_id': dtype('int64')}

---  genres  ---

{'genre_name': dtype('O'), 'genre_id': dtype('int64')}

---  types  ---

{'type_name': dtype('O'), 'type_id': dtype('int64')}

---  languages  ---

{'language_name': dtype('O'), 'language_id': dtype('int64')}

---  attributes  ---

{'attribute_name': dtype('O'), 'attribute_id': dtype('int64')}

---  title_akas  ---

{'tconst': dtype('O'), 'akas_id': dtype('int64')}

---  title_genres  ---

{'tconst': dtype('O'), 'genre_id': dtype('int64')}

---  title_types  ---

{'tconst': dtype('O'), 'type_id': dtype('int64')}

---  title_languages  ---

{'tconst': dtype('O'), 'language_id': dtype('int64')}

---  title_attributes  ---

{'tconst': dtype('O'), 'attribute_id': dtype('int64')}

In [43]:
# create a dictionary of lengths for strings and text
def get_lengths(dataframe):
    dtype_dict = dict(dataframe.dtypes)
    len_dict = {}
    for name, dtype in dtype_dict.items():
        if dtype == "object":
            key = f"len_{name}"
            value = dataframe[name].fillna('').map(len).max()
            len_dict[key] = value
    return len_dict

# create a dictionary of schema,
# test primary keys for strings, other words for text
def make_schema(dataframe, primary_keys):
    dtype_dict = dict(dataframe.dtypes)
    len_dict = get_lengths(dataframe)
    col_name = dataframe.columns.tolist()
    schema = {}
    for name, dtype in dtype_dict.items():
        if dtype == 'object' and (name in primary_keys):
            schema[name] = String(len_dict[f"len_{name}"]+1)
        elif dtype == 'object' and (name not in primary_keys):
            schema[name] = Text(len_dict[f"len_{name}"]+1)
        elif name == 'revenue':
            schema[name] = BigInteger()
        elif dtype == 'int64':
            schema[name] = Integer()
        elif dtype == 'float64':
            schema[name] = Float()
    return schema

list_of_primary_keys = ['tconst',
                        'akas_id',
                        'genre_id',
                        'type_id',
                        'language_id',
                        'attribute_id']

list_of_schema = []

for name, df in zip(table_names,list_of_dfs):
    temp_schema = make_schema(df, list_of_primary_keys)
    list_of_schema.append(temp_schema)
    print(f"{name}...")
    display(temp_schema)

title_basics...

{'tconst': String(length=11),
 'primaryTitle': Text(length=87),
 'startYear': Integer(),
 'runtimeMinutes': Integer()}

title_ratings...

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

title_tmdb...

{'tconst': String(length=11),
 'revenue': BigInteger(),
 'budget': Integer(),
 'certification': Text(length=6)}

akas...

{'title': Text(length=162),
 'region': Text(length=3),
 'isOriginalTitle': Integer(),
 'akas_id': Integer()}

genres...

{'genre_name': Text(length=10), 'genre_id': Integer()}

types...

{'type_name': Text(length=12), 'type_id': Integer()}

languages...

{'language_name': Text(length=3), 'language_id': Integer()}

attributes...

{'attribute_name': Text(length=31), 'attribute_id': Integer()}

title_akas...

{'tconst': String(length=11), 'akas_id': Integer()}

title_genres...

{'tconst': String(length=11), 'genre_id': Integer()}

title_types...

{'tconst': String(length=11), 'type_id': Integer()}

title_languages...

{'tconst': String(length=11), 'language_id': Integer()}

title_attributes...

{'tconst': String(length=11), 'attribute_id': Integer()}

## Converting to MySQL

In [44]:
df_title_tmdb.iloc[2330:2340,:]

         tconst     revenue     budget certification
2330  tt0486619          40     365000             R
2331  tt0489049      948753          0         PG-13
2332  tt0492044    77527732   10000000         PG-13
2333  tt0499549  2847246203  237000000         PG-13
2334  tt0758746    91509154   19000000             R
2335  tt0762073    13085023    5000000             R
2336  tt0762105     4243957    3000000         PG-13
2337  tt0762125   104945765   70000000            PG
2338  tt0765010    43318349   26000000             R
2339  tt0775552    57881056   45000000            PG

In [45]:
for name, df, schema in zip(table_names, list_of_dfs, list_of_schema):
    print(f"Creating MySQL Table {name}... with shape {df.shape}...with {len(schema)} schema...")
    df.to_sql(name, engine, dtype=schema, if_exists='replace', index=False)

Creating MySQL Table title_basics... with shape (6141, 4)...with 4 schema...
Creating MySQL Table title_ratings... with shape (6124, 3)...with 3 schema...
Creating MySQL Table title_tmdb... with shape (6141, 4)...with 4 schema...
Creating MySQL Table akas... with shape (9330, 4)...with 4 schema...
Creating MySQL Table genres... with shape (20, 2)...with 2 schema...
Creating MySQL Table types... with shape (9, 2)...with 2 schema...
Creating MySQL Table languages... with shape (4, 2)...with 2 schema...
Creating MySQL Table attributes... with shape (46, 2)...with 2 schema...
Creating MySQL Table title_akas... with shape (9330, 2)...with 2 schema...
Creating MySQL Table title_genres... with shape (15577, 2)...with 2 schema...
Creating MySQL Table title_types... with shape (8386, 2)...with 2 schema...
Creating MySQL Table title_languages... with shape (6347, 2)...with 2 schema...
Creating MySQL Table title_attributes... with shape (6996, 2)...with 2 schema...

In [46]:
for name, df, schema in zip(table_names, list_of_dfs, list_of_schema):
    col_list = df.columns.tolist()
    # Determine the primary key(s) of the table using
    # the interection of all the column names  and the list of primary keys
    prime_keys = set(col_list).intersection(list_of_primary_keys)
    # Prune away any extra characters from the prime_key string
    prime_keys = str(prime_keys).replace("{'","").replace("'}","").replace("'","`")
    string = f"ALTER TABLE {name} ADD PRIMARY KEY (`{prime_keys}`);"
    print(string)
    engine.execute(f"ALTER TABLE {name} ADD PRIMARY KEY (`{prime_keys}`);")

ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);
ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);
ALTER TABLE title_tmdb ADD PRIMARY KEY (`tconst`);
ALTER TABLE akas ADD PRIMARY KEY (`akas_id`);
ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);
ALTER TABLE types ADD PRIMARY KEY (`type_id`);
ALTER TABLE languages ADD PRIMARY KEY (`language_id`);
ALTER TABLE attributes ADD PRIMARY KEY (`attribute_id`);
ALTER TABLE title_akas ADD PRIMARY KEY (`tconst`, `akas_id`);
ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`, `genre_id`);
ALTER TABLE title_types ADD PRIMARY KEY (`tconst`, `type_id`);
ALTER TABLE title_languages ADD PRIMARY KEY (`tconst`, `language_id`);
ALTER TABLE title_attributes ADD PRIMARY KEY (`tconst`, `attribute_id`);

# Using SQL Queries

Showing the first 5 rows of each table.

In [47]:
for name in table_names:
    sql =f"SELECT * FROM {name} LIMIT 5"
    display(pd.read_sql_query(sql, engine))

      tconst                primaryTitle  startYear  runtimeMinutes
0  tt0035423              Kate & Leopold       2001             118
1  tt0069049  The Other Side of the Wind       2018             122
2  tt0118589                     Glitter       2001             104
3  tt0118652       The Attic Expeditions       2001             100
4  tt0118694        In the Mood for Love       2000              98

      tconst  averageRating  numVotes
0  tt0035423            6.4     83931
1  tt0069049            6.7      7250
2  tt0118589            2.3     23475
3  tt0118652            4.9      1819
4  tt0118694            8.0    145527

      tconst   revenue    budget certification
0  tt0035423  76019048  48000000         PG-13
1  tt0069049         0  12000000             R
2  tt0118589   5271666  22000000         PG-13
3  tt0118652         0   1000000             R
4  tt0118694  12854953    150000            PG

                        title region  isOriginalTitle  akas_id
0            Kate and Leopold     US                0        0
1              Kate & Leopold     US                0        1
2  The Other Side of the Wind     US                0        3
3                     Glitter     US                0       25
4           All That Glitters     US                0       26

  genre_name  genre_id
0     Action         0
1  Adventure         1
2  Animation         2
3  Biography         3
4     Comedy         4

     type_name  type_id
0         None        0
1  alternative        1
2          dvd        2
3     festival        3
4  imdbDisplay        4

  language_name  language_id
0          None            0
1            en            1
2            es            2
3            yi            3

                   attribute_name  attribute_id
0                            None             0
1                     3-D version             1
2                   DVD box title             2
3                    IMAX version             3
4  IMAX versionpromotional title             4

      tconst  akas_id
0  tt0035423        0
1  tt0035423        1
2  tt0069049        3
3  tt0118589       25
4  tt0118589       26

      tconst  genre_id
0  tt0035423         4
1  tt0035423         8
2  tt0035423        14
3  tt0069049         6
4  tt0118589         6

      tconst  type_id
0  tt0035423        0
1  tt0035423        4
2  tt0069049        4
3  tt0118589        4
4  tt0118589        8

      tconst  language_id
0  tt0035423            0
1  tt0069049            0
2  tt0118589            0
3  tt0118652            0
4  tt0118694            0

      tconst  attribute_id
0  tt0035423             0
1  tt0035423             5
2  tt0069049             0
3  tt0118589             0
4  tt0118652             0

Showing a list of all tables that were created.

In [48]:
sql="SHOW TABLES"
pd.read_sql_query(sql, engine)

    Tables_in_movies
0               akas
1         attributes
2             genres
3          languages
4         title_akas
5   title_attributes
6       title_basics
7       title_genres
8    title_languages
9      title_ratings
10        title_tmdb
11       title_types
12             types